export async function before(m) {

const username = conn.getName(m.sender)

if (m.chat.endsWith('broadcast') || m.fromMe || m.isGroup) return

let user = global.db.data.users[m.sender]

if (new Date() - user.pc < 21600000) return
await m.reply(`
👀 𝙃𝙤𝙡𝙖, 𝙢𝙪𝙘𝙝𝙤 𝙜𝙪𝙨𝙩𝙤!! 👋🏻✨
𝙨𝙤𝙮 𝙉𝙖𝙪𝙛𝙧𝙖𝙕𝙖𝙥𝙥-𝙈𝘿!!

✨🤩 𝘚𝘪 𝘲𝘶𝘪𝘦𝘳𝘦𝘴, 𝘱𝘶𝘦𝘥𝘦𝘴 𝘶𝘴𝘢𝘳
𝘦𝘭 𝘴𝘪𝘨𝘶𝘪𝘦𝘯𝘵𝘦 𝘤𝘰𝘮𝘢𝘯𝘥𝘰: *#menu*
𝘱𝘢𝘳𝘢 𝘷𝘦𝘳 𝘭𝘰𝘴 𝘤𝘰𝘮𝘢𝘯𝘥𝘰. 🏷️✨

🎒🥳 𝘕𝘰 𝘰𝘭𝘷𝘪𝘥𝘦𝘴 𝘴𝘦𝘨𝘶𝘪𝘳𝘯𝘰𝘴 𝘦𝘯
𝘯𝘶𝘦𝘴𝘵𝘳𝘰 𝘤𝘢𝘯𝘢𝘭 𝘱𝘳𝘪𝘯𝘤𝘪𝘱𝘢𝘭 𝘦𝘯
𝘥𝘰𝘯𝘥𝘦 𝘴𝘦 𝘴𝘶𝘣𝘪𝘳𝘢𝘯 𝘭𝘢𝘴 𝘯𝘰𝘷𝘦𝘥𝘢𝘥𝘦𝘴
𝘥𝘦𝘭 𝘣𝘰𝘵!!! ✨🎉
» ${canal}

👋🏻😃 ¿𝘛𝘪𝘦𝘯𝘦𝘴 𝘥𝘶𝘥𝘢𝘴 𝘰 𝘱𝘳𝘰𝘣𝘭𝘦𝘮𝘢𝘴?
𝘦𝘯𝘵𝘳𝘢 𝘢𝘲𝘶𝘪, 𝘱𝘶𝘦𝘥𝘦𝘴 𝘩𝘢𝘣𝘭𝘢𝘳 𝘴𝘰𝘣𝘳𝘦
𝘦𝘭 𝘵𝘦𝘮𝘢 𝘥𝘦𝘭 𝘣𝘰𝘵!!! ✨📲
» ${grupo1} ()

✨🤖 𝘌𝘯𝘵𝘳𝘢 𝘢𝘭 𝘨𝘳𝘶𝘱𝘰 𝘦𝘹𝘤𝘭𝘶𝘴𝘪𝘷𝘰
𝘱𝘢𝘳𝘢 𝘦𝘭 𝘣𝘰𝘵 𝘦𝘯 24/7, 𝘵𝘦 𝘦𝘴𝘱𝘦𝘳𝘢𝘮𝘰𝘴!! 🏷️👋🏻
» ${grupo2}

🤔 𝘚𝘪 𝘲𝘶𝘪𝘦𝘳𝘦𝘴 𝘪𝘯𝘴𝘵𝘢𝘭𝘢𝘳 𝘦𝘭 𝘣𝘰𝘵, 𝘱𝘶𝘦𝘥𝘦𝘴
𝘦𝘯𝘵𝘳𝘢𝘳 𝘢𝘲𝘶𝘪 𝘦𝘯 𝘦𝘭 𝘳𝘦𝘱𝘰𝘴𝘪𝘵𝘰𝘳𝘪𝘰!! 🌐
» ${md}
𝘰 𝘵𝘢𝘮𝘣𝘪𝘦𝘯 𝘪𝘯𝘴𝘵𝘢𝘭𝘢𝘯𝘥𝘰 𝘱𝘰𝘳 𝘢𝘲𝘶𝘪
𝘶𝘴𝘢𝘯𝘥𝘰 𝘦𝘭 𝘤𝘰𝘮𝘢𝘯𝘥𝘰: *#installbot*

🤩 𝘚𝘪 𝘯𝘰 𝘴𝘢𝘣𝘦𝘴 𝘪𝘯𝘴𝘵𝘢𝘭𝘢𝘳𝘭𝘰, 𝘮𝘪𝘳𝘢 
𝘦𝘴𝘵𝘦 𝘷𝘪𝘥𝘦𝘰 𝘦𝘹𝘤𝘭𝘶𝘴𝘪𝘷𝘰!!! ✨
» ${yt}
`)

user.pc = new Date * 1
}
